<!--<!--4. Перевірка наявності файлу:-->-->
<!--<!--● Реалізуйте перевірку, чи існує файл з таким же ім'ям у папці uploads.-->-->
<!--<!--● Якщо файл вже існує, повідомте про це користувача та запропонуйте йому змінити назву файлу або автоматично додайте унікальний суфікс-->
<!--до імені файлу (наприклад, дату або випадковий номер).-->-->

<?php
$upload_dir = 'uploads/';

echo "<h2>Список файлів:</h2>";

if (is_dir($upload_dir)) {
    $files = array_diff(scandir($upload_dir), ['.', '..']);

    if (count($files) > 0) {
        foreach ($files as $file) {
            echo "<a href='" . $upload_dir . $file . "' download>" . $file . "</a><br>";
        }
    } else {
        echo "Немає завантажених файлів";
    }
} else {
    echo "Директорія uploads не існує";
}

echo "<a href='index.html'>Назад</a>";
?>
